In [1]:
import pandas as pd

In [17]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']

               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

### Display Top 3 Rows of the Dataset

In [4]:
df1.head(3)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female

### Check Last Three Rows of the Dataset

In [5]:
df1.tail(3)

      Name  Marks  Gender
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

### Find Shape of Our Dataset (Number of Rows & Number of Columns)

In [10]:
df1.shape

(7, 3)

In [12]:
print('Number of Rows', df1.shape[0])
print('Number of Columns', df1.shape[1])

Number of Rows 7
Number of Columns 3

### Get Information About our dataset linke total number of Rows, total number of columns, datatypes of Each column and Memory requirement

In [18]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

### Check Null values in the dataset

In [20]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

### Get overall statistics about the dataframe

In [22]:
df1.describe(include = 'all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

### Find unique values from the gender column

In [24]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

### Find the number of unique values from the gender values

In [25]:
df1['Gender'].nunique()

2

### Display count of unique values in gender column

In [26]:
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

### Find the total number of students having marks between 90 to 100 (inclusive) using between method

In [30]:
df1[(df1['Marks']>= 90)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [36]:
len(df1[(df1['Marks']>= 90) & (df1['Marks']<= 100)])

4

In [39]:
sum(df1['Marks'].between(90, 100))

4

### Find the Average Marks

In [42]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [43]:
df1['Marks'].mean()

92.14285714285714

### Apply Method

In [84]:
def marks(x):
    return x/2

In [85]:
df1['Half Marks']=df1['Marks'].apply(marks)

In [86]:
df1

      Name  Marks  Gender  Half Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [87]:
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [88]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

### Map Function

In [89]:
df1

      Name  Marks  Gender  Half Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [90]:
df1['Male or Female']=df1['Gender'].map({'Male': 1, 'Female': 0})

In [91]:
df1

      Name  Marks  Gender  Half Marks  Male or Female
0  Priyang     98    Male        49.0               1
1   Aadhya     89  Female        44.5               0
2   Krisha     99  Female        49.5               0
3   Vedant     87    Male        43.5               1
4   Parshv     90    Male        45.0               1
5   Mittal     83  Female        41.5               0
6  Archana     99  Female        49.5               0

### Dropping a column

In [92]:
df1.drop('Male or Female', axis=1)

      Name  Marks  Gender  Half Marks
0  Priyang     98    Male        49.0
1   Aadhya     89  Female        44.5
2   Krisha     99  Female        49.5
3   Vedant     87    Male        43.5
4   Parshv     90    Male        45.0
5   Mittal     83  Female        41.5
6  Archana     99  Female        49.5

In [93]:
df1.drop(['Male or Female', 'Half Marks'], axis=1, inplace=True)

In [94]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

### Print the Name of the columns

In [95]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [96]:
df1.index

RangeIndex(start=0, stop=7, step=1)

### Sort the dataframe as per the marks column

In [97]:
df1.sort_values(by=['Marks', 'Gender'], ascending = False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

### Display Name & Marks of the Female Students

In [98]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [99]:
df1[df1['Gender']=='Female'][['Name', 'Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [100]:
df1[df1['Gender'].isin(['Female'])][['Name', 'Gender']]

      Name  Gender
1   Aadhya  Female
2   Krisha  Female
5   Mittal  Female
6  Archana  Female